15a-intro-to-rails/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "WHAT"], ["content", "IS THIS"], ["author", "THIS IS CRAZY"], ["created_at", "2018-11-02 14:45:21.387555"], ["updated_at", "2018-11-02 14:45:21.387555"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "lolwut"], ["updated_at", "2018-11-02 14:45:36.205288"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)